// import sampleImage from '@/public/droebiti-poto/modest-1.jpg';

// // Temporary mock data
// export const getAllNews = async () => {
//   return [
//     {
//       id: 1,
//       title: 'GEORGIAN RIDER GOT QUALIFIED FOR THE WORLD CUP 2025 IN BASEL',
//       image: sampleImage,
//       news_Description:
//         '🇬🇪👏ქართველი მხედარი მსოფლიო თასის ფინალში მიიღებს მონაწილეობას 17 ნოემბერს პოლონეთში, ქალაქ ვარშავაში  ცენტრალური ევროპის ლიგის მსოფლიო თასის შესარჩევი ეტაპი გაიმართა, სადაც საქართველოს მრავალგზის ჩემპიონი, ქართველი მხედარი შალვა გაჩეჩილაძე მონაწილეობდა 🏆საქართველოს საცხენოსნო სპორტის ეროვნული ფედერაციის ორგანიზებით, საქართველოს კულტურისა და სპორტის სამინისტროს მხარდაჭერით და საერთაშორისო საცხენოსნო ფედერაციის ჩართულობით, ლისი იპოდრომზე ცხენოსნობის მსოფლიო თასის კასპია-კავკასიის ლიგის შესარჩევი ეტაპი შემოდგომაზე გაიმართა, რომლის გამარჯვებული შალვა გაჩეჩილაძე გახდა. მას სეზონის ბოლოს დაჯამებული სარეიტინგო ქულების მიხედვით, მსოფლიო ჩემპიონატზე გამგზავრების შანსი მიეცა✅ვარშავაში გამართულ მსოფლიო თასის საკვალიფიკაციო ტურნირზე, სადაც ცენტრალური ევროპის ლიგის 50 საუკეთესო მხედარი იღებდა მონაწილეობას, შალვა გაჩეჩილაძემ ურთულესი მარშრუტი წარმატებით დაასრულა და  მსოფლიო ჩემპიონატზე მონაწილეობის უფლება მოიპოვა   🔝მსოფლიო თასის ფინალი ცხენოსნობაში გაზაფხულის სეზონზე, შვეიცარიაში გაიმართება, სადაც საქართველოს ისტორიაში პირველად ქართველი მხედარი მიიღებს მონაწილეობას',
//     },
//     {
//       id: 2,
//       title: 'GEORGIAN RIDER GOT QUALIFIED FOR THE WORLD CUP 2025 IN BASEL',
//       image: sampleImage,
//       news_Description:
//         '🇬🇪👏ქართველი მხედარი მსოფლიო თასის ფინალში მიიღებს მონაწილეობას 17 ნოემბერს პოლონეთში, ქალაქ ვარშავაში  ცენტრალური ევროპის ლიგის მსოფლიო თასის შესარჩევი ეტაპი გაიმართა, სადაც საქართველოს მრავალგზის ჩემპიონი, ქართველი მხედარი შალვა გაჩეჩილაძე მონაწილეობდა 🏆საქართველოს საცხენოსნო სპორტის ეროვნული ფედერაციის ორგანიზებით, საქართველოს კულტურისა და სპორტის სამინისტროს მხარდაჭერით და საერთაშორისო საცხენოსნო ფედერაციის ჩართულობით, ლისი იპოდრომზე ცხენოსნობის მსოფლიო თასის კასპია-კავკასიის ლიგის შესარჩევი ეტაპი შემოდგომაზე გაიმართა, რომლის გამარჯვებული შალვა გაჩეჩილაძე გახდა. მას სეზონის ბოლოს დაჯამებული სარეიტინგო ქულების მიხედვით, მსოფლიო ჩემპიონატზე გამგზავრების შანსი მიეცა✅ვარშავაში გამართულ მსოფლიო თასის საკვალიფიკაციო ტურნირზე, სადაც ცენტრალური ევროპის ლიგის 50 საუკეთესო მხედარი იღებდა მონაწილეობას, შალვა გაჩეჩილაძემ ურთულესი მარშრუტი წარმატებით დაასრულა და  მსოფლიო ჩემპიონატზე მონაწილეობის უფლება მოიპოვა   🔝მსოფლიო თასის ფინალი ცხენოსნობაში გაზაფხულის სეზონზე, შვეიცარიაში გაიმართება, სადაც საქართველოს ისტორიაში პირველად ქართველი მხედარი მიიღებს მონაწილეობას',
//     },
//     {
//       id: 3,
//       title: 'GEORGIAN RIDER GOT QUALIFIED FOR THE WORLD CUP 2025 IN BASEL',
//       image: sampleImage,
//       news_Description:
//         '🇬🇪👏ქართველი მხედარი მსოფლიო თასის ფინალში მიიღებს მონაწილეობას 17 ნოემბერს პოლონეთში, ქალაქ ვარშავაში  ცენტრალური ევროპის ლიგის მსოფლიო თასის შესარჩევი ეტაპი გაიმართა, სადაც საქართველოს მრავალგზის ჩემპიონი, ქართველი მხედარი შალვა გაჩეჩილაძე მონაწილეობდა 🏆საქართველოს საცხენოსნო სპორტის ეროვნული ფედერაციის ორგანიზებით, საქართველოს კულტურისა და სპორტის სამინისტროს მხარდაჭერით და საერთაშორისო საცხენოსნო ფედერაციის ჩართულობით, ლისი იპოდრომზე ცხენოსნობის მსოფლიო თასის კასპია-კავკასიის ლიგის შესარჩევი ეტაპი შემოდგომაზე გაიმართა, რომლის გამარჯვებული შალვა გაჩეჩილაძე გახდა. მას სეზონის ბოლოს დაჯამებული სარეიტინგო ქულების მიხედვით, მსოფლიო ჩემპიონატზე გამგზავრების შანსი მიეცა✅ვარშავაში გამართულ მსოფლიო თასის საკვალიფიკაციო ტურნირზე, სადაც ცენტრალური ევროპის ლიგის 50 საუკეთესო მხედარი იღებდა მონაწილეობას, შალვა გაჩეჩილაძემ ურთულესი მარშრუტი წარმატებით დაასრულა და  მსოფლიო ჩემპიონატზე მონაწილეობის უფლება მოიპოვა   🔝მსოფლიო თასის ფინალი ცხენოსნობაში გაზაფხულის სეზონზე, შვეიცარიაში გაიმართება, სადაც საქართველოს ისტორიაში პირველად ქართველი მხედარი მიიღებს მონაწილეობას',
//     },
//   ];
// };

// export const getNewsById = async (id) => {
//   const allNews = await getAllNews();
//   return allNews.find((n) => n.id === Number(id));
// };

// actions/news-actions/newsActions.js
import axiosInstance from '@/utils/axiosInstance';

export const getAllNews = async () => {
  const res = await axiosInstance.get('news/');
  return res.data;
};

export const fetchNewsById = async (id) => {
  const newsItems = await getAllNews();
  const news = newsItems.find((n) => n.id === Number(id));
  if (!news) throw new Error('News not found');
  return news;
};
